SmartArduino/WiFiMCU/Platform/vendor/nxp/LPC54xx/lpc1800_freertos.c
/*
 * Copyright (c) 2001-2003 Swedish Institute of Computer Science.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. The name of the author may not be used to endorse or promote products
 *    derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT
 * SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT
 * OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
 * IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
 * OF SUCH DAMAGE.
 *
 * This file is part of the lwIP TCP/IP stack.
 *
 * Author: Adam Dunkels <adam@sics.se>
 *
 */
/* lwIP includes. */
#include <stdio.h>
#include "MicoRtos.h"

#include "board.h"
#include "string.h"
#include "stdio.h"

#define ATH_SPI_DMA             1
/* DMA completion flag */
volatile uint8_t bDMASPITXDoneFlag = false;
volatile uint8_t bDMASPIRXDoneFlag = false;

DMA_CHDESC_T dmaSPITxDesc, dmaSPIRxDesc;

//#define SEMAPHORE       1
#define SEMDELAY        100
//#define SPIDEBUG 1
mico_semaphore_t spi_transfer_finished_semaphore;

#define WIFI_SPI_PORTNUM1          1

extern void spi_irq_handler( );

/**
 * @brief	DMA Interrupt Handler
 * @return	None
 */
/*****************************************************************************
 * Public functiion
*****************************************************************************/
/**
 * @brief	DMA Interrupt Handler
 * @return	None
 */
extern void uart0_rx_dma_handler(void);
extern void uart0_tx_dma_handler(void);

extern void spi_cs_Set(uint8_t status);
extern void uart0_dma_tx_handler(void);
extern void uart0_dma_rx_handler(void);
void DMA_IRQHandler(void)
{
  /* Clear DMA interrupt for the channel */
  if ( (Chip_DMA_GetIntStatus(LPC_DMA) & DMA_INTSTAT_ACTIVEINT) != 0 ) {
    if ( Chip_DMA_GetActiveIntAChannels(LPC_DMA) & (1 << DMAREQ_SPI1_TX) ) {
      Chip_DMA_ClearActiveIntAChannel(LPC_DMA, DMAREQ_SPI1_TX);
      bDMASPITXDoneFlag = true;
    }
    if ( Chip_DMA_GetActiveIntAChannels(LPC_DMA) & (1 << DMAREQ_SPI1_RX) ) {
      Chip_DMA_ClearActiveIntAChannel(LPC_DMA, DMAREQ_SPI1_RX);
      bDMASPIRXDoneFlag = true;
      mico_rtos_set_semaphore( &spi_transfer_finished_semaphore );
    }
    if ( Chip_DMA_GetActiveIntAChannels(LPC_DMA) & (1 << DMAREQ_UART0_TX) ) {
      Chip_DMA_ClearActiveIntAChannel(LPC_DMA, DMAREQ_UART0_TX);
      uart0_dma_tx_handler();
    }
    if ( Chip_DMA_GetActiveIntAChannels(LPC_DMA) & (1 << DMAREQ_UART0_RX) ) {
      Chip_DMA_ClearActiveIntAChannel(LPC_DMA, DMAREQ_UART0_RX);
      uart0_dma_rx_handler();
    }
  }
}

#define SPI_FRAME_LENGTH		8

uint8_t SPI_DMA_Init(void)
{
  uint8_t ret = false;
  //bool    err = false;
  //uint32_t i = 0;
  bDMASPITXDoneFlag = bDMASPIRXDoneFlag = false;
/* DMA initialization - enable DMA clocking and reset DMA if needed */
  Chip_DMA_Init(LPC_DMA);
/* Enable DMA controller and use driver provided DMA table for current descriptors */
  Chip_DMA_Enable(LPC_DMA);
  Chip_DMA_SetSRAMBase(LPC_DMA, DMA_ADDR(Chip_DMA_Table));

  Chip_SPI_SetControlInfo(LPC_SPI1, SPI_FRAME_LENGTH, SPI_TXDATCTL_SSELN(SLAVE0));
  Chip_DMA_SetValidChannel(LPC_DMA, DMAREQ_SPI1_TX);
  
  Chip_SPI_SetControlInfo(LPC_SPI1, SPI_FRAME_LENGTH, SPI_TXDATCTL_SSELN(SLAVE0));
  Chip_DMA_SetValidChannel(LPC_DMA, DMAREQ_SPI1_RX);
  
  LPC_SYSCON->AHBMATPRIO |= 0x03 << 8;
  /* Enable DMA interrupt */
  NVIC_SetPriority(DMA_IRQn, 5);
  NVIC_EnableIRQ(DMA_IRQn);
  return ret;
}

uint8_t SPI_DMA_DeInit(void)
{
  uint8_t ret = false;
  //bool    err = false;
  
  bDMASPITXDoneFlag = bDMASPIRXDoneFlag = false;
  
  Chip_DMA_DisableChannel(LPC_DMA, DMAREQ_SPI1_TX);
  Chip_DMA_DisableIntChannel(LPC_DMA, DMAREQ_SPI1_TX);
  Chip_DMA_DisableChannel(LPC_DMA, DMAREQ_SPI1_RX);
  Chip_DMA_DisableIntChannel(LPC_DMA, DMAREQ_SPI1_RX);  

  Chip_DMA_Disable(LPC_DMA);
  Chip_DMA_DeInit(LPC_DMA);
  NVIC_DisableIRQ(DMA_IRQn);  
  ret = true;
  return ret;
}

uint8_t ADC_Init(void)
{
  return true;
}

uint8_t ADC_DeInit(void)
{
	/* Setup sequencer A for all 12 ADC channels, EOS interrupt */
#if defined(BOARD_NXP_LPCXPRESSO_54000)
  /* All pins to inactive, neither pull-up nor pull-down. */
  Chip_IOCON_PinMuxSet(LPC_IOCON, 0, 29, IOCON_MODE_INACT | IOCON_FUNC0 | IOCON_ANALOG_EN);
  Chip_IOCON_PinMuxSet(LPC_IOCON, 0, 30, IOCON_MODE_INACT | IOCON_FUNC0 | IOCON_ANALOG_EN);
  Chip_IOCON_PinMuxSet(LPC_IOCON, 0, 31, IOCON_MODE_INACT | IOCON_FUNC0 | IOCON_ANALOG_EN);
  Chip_IOCON_PinMuxSet(LPC_IOCON, 1,  0, IOCON_MODE_INACT | IOCON_FUNC0 | IOCON_ANALOG_EN);
  Chip_IOCON_PinMuxSet(LPC_IOCON, 1,  1, IOCON_MODE_INACT | IOCON_FUNC0 | IOCON_ANALOG_EN);
  Chip_IOCON_PinMuxSet(LPC_IOCON, 1,  2, IOCON_MODE_INACT | IOCON_FUNC0 | IOCON_ANALOG_EN);
  Chip_IOCON_PinMuxSet(LPC_IOCON, 1,  3, IOCON_MODE_INACT | IOCON_FUNC0 | IOCON_ANALOG_EN);
  Chip_IOCON_PinMuxSet(LPC_IOCON, 1,  4, IOCON_MODE_INACT | IOCON_FUNC0 | IOCON_ANALOG_EN);
  Chip_IOCON_PinMuxSet(LPC_IOCON, 1,  5, IOCON_MODE_INACT | IOCON_FUNC0 | IOCON_ANALOG_EN);
  Chip_IOCON_PinMuxSet(LPC_IOCON, 1,  6, IOCON_MODE_INACT | IOCON_FUNC0 | IOCON_ANALOG_EN);
  Chip_IOCON_PinMuxSet(LPC_IOCON, 1,  7, IOCON_MODE_INACT | IOCON_FUNC0 | IOCON_ANALOG_EN);
  Chip_IOCON_PinMuxSet(LPC_IOCON, 1,  8, IOCON_MODE_INACT | IOCON_FUNC0 | IOCON_ANALOG_EN);

  Chip_ADC_DisableInt(LPC_ADC, (ADC_INTEN_SEQA_ENABLE | ADC_INTEN_OVRRUN_ENABLE));
  Chip_ADC_DisableSequencer(LPC_ADC, ADC_SEQA_IDX);
/* Enable ADC NVIC interrupt */
  NVIC_DisableIRQ(ADC_SEQA_IRQn);
  NVIC_DisableIRQ(ADC_SEQB_IRQn);
/* Clear all pending interrupts */
  Chip_ADC_ClearFlags(LPC_ADC, Chip_ADC_GetFlags(LPC_ADC));
  
