SmartArduino/WiFiMCU/Platform/vendor/nxp/LPC54xx/lpc1800_freertos.c
  Chip_ADC_DeInit(LPC_ADC);
#else
#warning "No ADC setup for this example"
#endif
  return true;
}

//void QCA_SYS_DELAY(uint32_t time)
//{
//  vTaskDelay(time);
//}
/**wlan wakeup ===*/
#define GPIO_GPOWKE_PORT	0  // 0
#define GPIO_GPOWKE_PIN		22 // 29

#define GPIO_GPOPWD_PORT	0  // 0
#define GPIO_GPOPWD_PIN		3 // 29

#define GPIO_GPOFET_PORT	0
#define GPIO_GPOFET_PIN		25
/**=====spi wireless=======**/
#define GPIO_SSPSEL_PORT	1
#define GPIO_SSPSEL_PIN		15

#define GPIO_SSPCLK_PORT	1
#define GPIO_SSPCLK_PIN		6

#define GPIO_SSPMISO_PORT       1
#define GPIO_SSPMISO_PIN	14

#define GPIO_SSPMOSI_PORT	1
#define GPIO_SSPMOSI_PIN	7

#define GPIO_SPIINT_PORT        	0
#define GPIO_SPIINT_PIN		4
#define GPIO_SPIINT_INDEX	PININTSELECT0	/* PININT index used for GPIO mapping */
/**=====spi wireless end=======**/
#define GPIO_STATUS_PORT        1
#define GPIO_STATUS_PIN         2
#define GPIO_STATUS_INDEX	PININTSELECT4	/* PININT index used for GPIO mapping */

#define GPIO_BOOT_PORT          1
#define GPIO_BOOT_PIN           4
#define GPIO_BOOT_INDEX	        PININTSELECT5	/* PININT index used for GPIO mapping */

#define GPIO_STANBY_PORT        1
#define GPIO_STANBY_PIN         8
#define GPIO_STANBY_INDEX	PININTSELECT6	/* PININT index used for GPIO mapping */

#define GPIO_EASYLINK_PORT      0
#define GPIO_EASYLINK_PIN       18
#define GPIO_EASYLINK_INDEX	PININTSELECT7	/* PININT index used for GPIO mapping */

void PIN_INT0_IRQHandler(void)
{
  Chip_PININT_ClearIntStatus(LPC_PININT, PININTCH(GPIO_SPIINT_INDEX)); 
  spi_irq_handler();
}

void PIN_INT1_IRQHandler(void)
{
 // Chip_PININT_ClearIntStatus(LPC_PININT, PININTCH(GPIO_SPIINT_INDEX)); 

}

void PIN_INT2_IRQHandler(void)
{
//  Chip_PININT_ClearIntStatus(LPC_PININT, PININTCH(GPIO_SPIINT_INDEX)); 

}

void PIN_INT3_IRQHandler(void)
{
//  Chip_PININT_ClearIntStatus(LPC_PININT, PININTCH(GPIO_SPIINT_INDEX)); 

}

void PIN_INT4_IRQHandler(void)
{
//  Chip_PININT_ClearIntStatus(LPC_PININT, PININTCH(GPIO_STATUS_INDEX)); 
  printf("status button\r\n");
}

void PIN_INT5_IRQHandler(void)
{
//  Chip_PININT_ClearIntStatus(LPC_PININT, PININTCH(GPIO_BOOT_INDEX)); 
  printf("boot button\r\n");
}

void PIN_INT6_IRQHandler(void)
{
  Chip_PININT_ClearIntStatus(LPC_PININT, PININTCH(GPIO_STANBY_INDEX)); 
  printf("standby button\r\n");
}

//static uint32_t _default_start_time = 0;
//static mico_timer_t _button_EL_timer;
#define RestoreDefault_TimeOut          3000  /**< Restore default and start easylink after 
                                                press down EasyLink button for 3 seconds. */

void PIN_INT7_IRQHandler(void)
{
//  int interval = -1;
  
  Chip_PININT_ClearIntStatus(LPC_PININT, PININTCH(GPIO_EASYLINK_INDEX)); 
  
  if ( Chip_GPIO_ReadPortBit(LPC_GPIO, GPIO_EASYLINK_PORT, GPIO_EASYLINK_PIN) == 0 ) {
    printf("easy link button\r\n");
//    _default_start_time = mico_get_time()+1;
//    mico_start_timer(&_button_EL_timer);
//  } else {
//    interval = mico_get_time() + 1 - _default_start_time;
//    if ( (_default_start_time != 0) && interval > 50 && interval < RestoreDefault_TimeOut){
//      /* EasyLink button clicked once */
      PlatformEasyLinkButtonClickedCallback();
//    }
//    mico_stop_timer(&_button_EL_timer);
//    _default_start_time = 0;
  }
}

/*
uint32_t gint0_count = 0;
void GINT0_IRQHandler(void)
{
  Chip_GPIOGP_ClearIntStatus(LPC_GINT, 0);
  gint0_count++;
  printf("GINT0 \r\n");	
}
*/

 /*  
void PIN_INT1_IRQHandler(void)
{
 int interval = -1;
  Chip_PININT_ClearIntStatus(LPC_PININT, PININTCH(GPIO_EASYLINK_INDEX)); 
  printf("Easylink\r\n");
 
  if ( Chip_GPIO_ReadPortBit(LPC_GPIO, GPIO_EASYLINK_PORT, GPIO_EASYLINK_PIN) == 0 ) {
    _default_start_time = mico_get_time()+1;
    mico_start_timer(&_button_EL_timer);
  } else {
    interval = mico_get_time() + 1 - _default_start_time;
    if ( (_default_start_time != 0) && interval > 50 && interval < RestoreDefault_TimeOut){
      PlatformEasyLinkButtonClickedCallback();
    }
    mico_stop_timer(&_button_EL_timer);
    _default_start_time = 0;
  }
}
*/

uint8_t STATUS_GPIO_Init(void)
{
  Chip_GPIO_SetPinState(LPC_GPIO, GPIO_STATUS_PORT, GPIO_STATUS_PIN, 1);
  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_STATUS_PORT, GPIO_STATUS_PIN, (IOCON_FUNC0 | IOCON_GPIO_MODE | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));
  Chip_GPIO_SetPinDIRInput(LPC_GPIO, GPIO_STATUS_PORT, GPIO_STATUS_PIN);
  return true;
}

uint8_t BOOT_GPIO_Init(void)
{
  Chip_GPIO_SetPinState(LPC_GPIO, GPIO_BOOT_PORT, GPIO_BOOT_PIN, 1);
  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_BOOT_PORT, GPIO_BOOT_PIN, (IOCON_FUNC0 | IOCON_GPIO_MODE | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));
  Chip_GPIO_SetPinDIRInput(LPC_GPIO, GPIO_BOOT_PORT, GPIO_BOOT_PIN);
  return true;
}

uint8_t STANDBY_GPIO_Init(void)
{
  Chip_GPIO_SetPinState(LPC_GPIO, GPIO_STANBY_PORT, GPIO_STANBY_PIN, 1);
  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_STANBY_PORT, GPIO_STANBY_PIN, (IOCON_FUNC0 | IOCON_GPIO_MODE | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));
  Chip_GPIO_SetPinDIRInput(LPC_GPIO, GPIO_STANBY_PORT, GPIO_STANBY_PIN);
  

  return true;
}

uint8_t EASYLINK_GPIO_Init(void)
{
  Chip_GPIO_SetPinState(LPC_GPIO, GPIO_EASYLINK_PORT, GPIO_EASYLINK_PIN, 1);
  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_EASYLINK_PORT, GPIO_EASYLINK_PIN, (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_GPIO_MODE | IOCON_DIGITAL_EN));
  Chip_GPIO_SetPinDIRInput(LPC_GPIO, GPIO_EASYLINK_PORT, GPIO_EASYLINK_PIN);
  return true;
}

uint8_t EASYLINK_GPIO_Get(void)
{
  return (Chip_GPIO_GetPinState(LPC_GPIO, GPIO_EASYLINK_PORT, GPIO_EASYLINK_PIN));
}

uint8_t RESET_GPIO_Init(void)
{
  Chip_GPIO_SetPinState(LPC_GPIO, GPIO_GPOPWD_PORT, GPIO_GPOPWD_PIN, 0);
  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_GPOPWD_PORT, GPIO_GPOPWD_PIN, (IOCON_FUNC0 | IOCON_GPIO_MODE | IOCON_DIGITAL_EN));
  Chip_GPIO_SetPinDIROutput(LPC_GPIO, GPIO_GPOPWD_PORT, GPIO_GPOPWD_PIN);
  return true;
}

uint8_t RESET_GPIO_DeInit(void)
{
  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_GPOPWD_PORT, GPIO_GPOPWD_PIN, (IOCON_FUNC0 | IOCON_GPIO_MODE | IOCON_DIGITAL_EN));
  Chip_GPIO_SetPinDIRInput(LPC_GPIO, GPIO_GPOPWD_PORT, GPIO_GPOPWD_PIN);
  return true;
}

