SmartArduino/WiFiMCU/Platform/vendor/nxp/LPC54xx/lpc1800_freertos.c
void RESET_GPIO_Set(uint8_t status)
{
  if(status == 0) Chip_GPIO_SetPinState(LPC_GPIO, GPIO_GPOPWD_PORT, GPIO_GPOPWD_PIN, 0);
  else            Chip_GPIO_SetPinState(LPC_GPIO, GPIO_GPOPWD_PORT, GPIO_GPOPWD_PIN, 1);
}

uint8_t QCAFET_GPIO_Init(void)
{
  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_GPOFET_PORT, GPIO_GPOFET_PIN, (IOCON_FUNC0 | IOCON_GPIO_MODE | IOCON_DIGITAL_EN));
  Chip_GPIO_SetPinDIROutput(LPC_GPIO, GPIO_GPOFET_PORT, GPIO_GPOFET_PIN);
  Chip_GPIO_SetPinState(LPC_GPIO, GPIO_GPOFET_PORT, GPIO_GPOFET_PIN, 0);
  return true;
}

void QCAFET_GPIO_Set(uint8_t status)
{
  if(status == 0) Chip_GPIO_SetPinState(LPC_GPIO, GPIO_GPOFET_PORT, GPIO_GPOFET_PIN, 0);
  else            Chip_GPIO_SetPinState(LPC_GPIO, GPIO_GPOFET_PORT, GPIO_GPOFET_PIN, 1);
}

void QCALED_GPIO_Set(uint8_t status)
{
  if(status == 0) Chip_GPIO_SetPinState(LPC_GPIO, 1, 5, 0);
  else            Chip_GPIO_SetPinState(LPC_GPIO, 1, 5, 1);
}

void spi_cs_init(void)
{
  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_SSPSEL_PORT, GPIO_SSPSEL_PIN, IOCON_MODE_REPEATER);
  Chip_GPIO_SetPinDIROutput(LPC_GPIO, GPIO_SSPSEL_PORT, GPIO_SSPSEL_PIN);
  Chip_GPIO_SetPinState(LPC_GPIO, GPIO_SSPSEL_PORT, GPIO_SSPSEL_PIN, 1);
}
void spi_cs_Set(uint8_t status)
{
  if(status == 0) Chip_GPIO_SetPinState(LPC_GPIO, GPIO_SSPSEL_PORT, GPIO_SSPSEL_PIN, 0);
  else            Chip_GPIO_SetPinState(LPC_GPIO, GPIO_SSPSEL_PORT, GPIO_SSPSEL_PIN, 1);
}

uint8_t SPI_GPIO_Init(void)
{
  Chip_IOCON_PinMuxSet(LPC_IOCON, 0, 22, (IOCON_FUNC0 | IOCON_GPIO_MODE | IOCON_DIGITAL_EN));
  Chip_GPIO_SetPinDIROutput(LPC_GPIO, 0, 22);
  Chip_GPIO_SetPinState(LPC_GPIO, 0, 22, 1);
  
#if (defined(BOARD_NXP_LPCXPRESSO_54000))
  spi_cs_init();
//  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_SSPSEL_PORT,  GPIO_SSPSEL_PIN,  (IOCON_FUNC1 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));	/* SSEL */
  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_SSPCLK_PORT,  GPIO_SSPCLK_PIN,  (IOCON_FUNC2 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN)); //(IOCON_FUNC5 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));	/* SCK */
  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_SSPMISO_PORT, GPIO_SSPMISO_PIN, (IOCON_FUNC4 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN)); // (IOCON_FUNC5 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));	/* MISO */
  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_SSPMOSI_PORT, GPIO_SSPMOSI_PIN, (IOCON_FUNC2 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));	/* MOSI */

  Chip_IOCON_PinMuxSet(LPC_IOCON, 1, 2,  (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN)); //(IOCON_FUNC5 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));	/* SCK */
  Chip_IOCON_PinMuxSet(LPC_IOCON, 1, 3, (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN)); // (IOCON_FUNC5 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));	/* MISO */
  Chip_IOCON_PinMuxSet(LPC_IOCON, 1, 4, (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));
//  Chip_IOCON_PinMuxSet(LPC_IOCON, 1, 5, (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));
  Chip_IOCON_PinMuxSet(LPC_IOCON, 1, 8, (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));
  Chip_IOCON_PinMuxSet(LPC_IOCON, 1, 9, (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));
  Chip_IOCON_PinMuxSet(LPC_IOCON, 1, 12, (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));
  Chip_IOCON_PinMuxSet(LPC_IOCON, 1, 13, (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));
  Chip_IOCON_PinMuxSet(LPC_IOCON, 1, 16, (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));
  
  
#else
	/* Configure your own SPI pin muxing here if needed */
#warning "No SPI pin muxing defined"
#endif
	
  return true;
}

uint8_t SPI_GPIO_DeInit(void)
{
  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_SSPSEL_PORT,  GPIO_SSPSEL_PIN,  (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));	/* SSEL */
  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_SSPCLK_PORT,  GPIO_SSPCLK_PIN,  (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));	/* SCK */
  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_SSPMISO_PORT, GPIO_SSPMISO_PIN, (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));	/* MISO */
  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_SSPMOSI_PORT, GPIO_SSPMOSI_PIN, (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));	/* MOSI */	
  return true;
}

static volatile bool mEnd, sEnd;

/* SPI master select assertion callback function */
static void SPIMasterAssert(SPIM_XFER_T *pMasterXfer)
{
	/* Indicates tha master just asserted the slave select
	   signal */
}

/* SPI master send data callback function */
static void SPIMasterSendData(SPIM_XFER_T *pMasterXfer)
{
	/* This callback is called when the master needs more data to
	   send. The pMasterXfer->pTXData buffer pointer and transfer size
	   (in items) in pMasterXfer->txCount should be updated. */

	/* If this function sets the pMasterXfer->terminate flag to true,
	   this function won't be called again and the transfer will
	   terminate when the current transmit buffer is complete. */

	/* This example sets up the entire transfer structure without
	   using this callback. */
}

/* SPI master receive data callback function */
static void SPIMasterRecvData(SPIM_XFER_T *pMasterXfer)
{
	/* This callback is called when the master needs another receive
	   buffer. The pMasterXfer->pRXData buffer pointer and transfer size
	   (in items) in pMasterXfer->rxCount shoudl be updated. */

	/* This example sets up the entire transfer structure without
	   using this callback. */
}

/* SPI master select de-assertion callback function */
static void SPIMasterDeAssert(SPIM_XFER_T *pMasterXfer)
{
  /* Indicates tha master just deasserted the slave select
     signal */
}

/* SPI master transfer done callback */
static void SPIMasterDone(SPIM_XFER_T *pMasterXfer)
{
  /* Indicates tha transfer is complete */
  mEnd = true;
}

/* SPI master driver callbacks */
static const SPIM_CALLBACKS_T spiMasterCallbacks = {
  &SPIMasterAssert,
  &SPIMasterSendData,
  &SPIMasterRecvData,
  &SPIMasterDeAssert,
  &SPIMasterDone
};


SPIM_XFER_T spiMasterXfer;

void SPI1_IRQHandler(void)
{
  uint32_t ints = Chip_SPI_GetPendingInts(LPC_SPI1);

  /* Handle SPI slave interrupts only */
  if ((ints &  (SPI_INTENSET_RXDYEN | SPI_INTENSET_RXOVEN |
                SPI_INTENSET_TXUREN | SPI_INTENSET_SSAEN | SPI_INTENSET_SSDEN)) != 0) {
  /* SPI slave handler */
    Chip_SPIM_XferHandler(LPC_SPI1, &spiMasterXfer);
  }
}


extern void SPI_IRQ_ENABLE(void);
extern void SPI_IRQ_DISABLE(void);
extern uint8_t SPI_Int_Init(void);
uint8_t SPI_Init(void)
{
  SPI_CFGSETUP_T spiSetup;
  SPIM_DELAY_CONFIG_T masterDelay;
  SPI_GPIO_Init();
  
  Chip_SPI_Init(LPC_SPI1);
  
