SmartArduino/WiFiMCU/Platform/vendor/nxp/LPC54xx/lpc1800_freertos.c
  spiSetup.master = 1;
  spiSetup.lsbFirst = 0;
  spiSetup.mode = SPI_CLOCK_MODE3;
  Chip_SPI_ConfigureSPI(LPC_SPI1, &spiSetup);
  /* Setup master controller SSEL0 for active low select */
  Chip_SPI_SetCSPolLow(LPC_SPI1, 0);
  /* Setup master clock rate, slave clock doesn't need to be setup */
  Chip_SPIM_SetClockRate(LPC_SPI1, 20000000);

  /* Setup master delay (all chip selects) */
  masterDelay.PreDelay			= 0x01;
  masterDelay.PostDelay			= 0x01;
  masterDelay.FrameDelay		= 0x01;
  masterDelay.TransferDelay             = 0x01;
  Chip_SPIM_DelayConfig(LPC_SPI1, &masterDelay);

  /* Setup master transfer callbacks in the transfer descriptor */
  spiMasterXfer.pCB = &spiMasterCallbacks;
  Chip_SPI_SetXferSize(LPC_SPI1, 8);

	/* Setup master trasnfer options - 16 data bits per transfer, EOT, EOF */
  spiMasterXfer.options =
		SPI_TXCTL_FLEN(8) |		/* This must be enabled as a minimum, use 16 data bits */
		// SPI_TXCTL_EOT |			/* Enable this to assert and deassert SSEL for each individual byte/word, current slave functions for this example do not support this */
		// SPI_TXCTL_EOF |			/* Insert a delay between bytes/words as defined by frame delay time */
		// SPI_TXCTL_RXIGNORE |		/* Enable this to ignore incoming data, or set spiMasterXfer.pRXData16 to NULL to ignore RX data  */
		0;

  /* Transfer will terminate after current buffer is sent. If terminate is not set, the buffers
    must be setup by the callbacks		*/
  spiMasterXfer.terminate = true;

  /* Use SPI select 0 */
  spiMasterXfer.sselNum = 0;
  mico_rtos_init_semaphore(&spi_transfer_finished_semaphore, 1);
  
#ifndef ATH_SPI_DMA
  Chip_SPI_Enable(LPC_SPI1);
  /* For the SPI controller configured in master mode, enable SPI master interrupts
     for interrupt service. Do not enable SPI_INTENSET_TXDYEN. */
  Chip_SPI_EnableInts(LPC_SPI1, (SPI_INTENSET_RXDYEN |
                      SPI_INTENSET_RXOVEN | SPI_INTENSET_TXUREN | SPI_INTENSET_SSAEN |
                      SPI_INTENSET_SSDEN));	
  Chip_SPI_FlushFifos(LPC_SPI1);	
  NVIC_EnableIRQ(SPI1_IRQn);
#else
//  Chip_SPI_Int_Cmd(LPC_SPI0, SPI_INTENSET_TXDYEN | SPI_INTENSET_RXDYEN | SPI_INTENSET_RXOVEN | SPI_INTENSET_TXUREN, ENABLE);
  
  Chip_SPI_Enable(LPC_SPI1);
  SPI_DMA_Init();
#ifdef SEMAPHORE 
  mico_rtos_get_semaphore( &spi_transfer_finished_semaphore, SEMDELAY );
#endif
  
#endif 

  SPI_Int_Init();
  
//  EASYLINK_GPIO_Init();
 // STANDBY_GPIO_Init();
  /*
  BOOT_GPIO_Init();
  STATUS_GPIO_Init();
  
  */
  return true;
}

uint8_t SPI_DeInit(void)
{
#ifndef WIFI_SPI_PORTNUM1
#ifndef ATH_SPI_DMA
  SPI_IRQ_DISABLE();
  NVIC_ClearPendingIRQ(SPI0_IRQn);
  NVIC_DisableIRQ(SPI0_IRQn);
#else
  SPI_IRQ_DISABLE();
  
  SPI_DMA_DeInit();
  Chip_SPI_Disable(LPC_SPI0);
  SPI_GPIO_DeInit();
  Chip_SPI_DeInit(LPC_SPI0);
#endif
  
#else
 #ifndef ATH_SPI_DMA
  SPI_IRQ_DISABLE();
  NVIC_ClearPendingIRQ(SPI1_IRQn);
  NVIC_DisableIRQ(SPI1_IRQn);
#else
  SPI_IRQ_DISABLE();
  
  SPI_DMA_DeInit();
  Chip_SPI_Disable(LPC_SPI1);
  SPI_GPIO_DeInit();
  Chip_SPI_DeInit(LPC_SPI1);
#endif 
#endif
  return true;
}


uint8_t SPI_Int_Init(void)
{

  Chip_PININT_Init(LPC_PININT);
  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_SPIINT_PORT, GPIO_SPIINT_PIN, (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN  | IOCON_GPIO_MODE));
  Chip_GPIO_SetPinDIRInput(LPC_GPIO, GPIO_SPIINT_PORT, GPIO_SPIINT_PIN);

  /* Configure pin interrupt selection for the GPIO pin in Input Mux Block */
  Chip_INMUX_PININT_Config(LPC_INMUX, GPIO_SPIINT_INDEX, GPIO_SPIINT_PORT, GPIO_SPIINT_PIN);

  /* Configure channel interrupt as edge sensitive and falling edge interrupt */
  Chip_PININT_ClearIntStatus(LPC_PININT, PININTCH(GPIO_SPIINT_INDEX));
  Chip_PININT_SetPinModeEdge(LPC_PININT, PININTCH(GPIO_SPIINT_INDEX));
  Chip_PININT_EnableIntLow(LPC_PININT, PININTCH(GPIO_SPIINT_INDEX));
//  Chip_PININT_EnableIntHigh(LPC_PININT, PININTCH(GPIO_SPIINT_INDEX));
  
//  NVIC_SetPriority(PININT0_IRQn, 1);
  /* Enable interrupt in the NVIC */
  NVIC_ClearPendingIRQ(PININT0_IRQn);
  NVIC_EnableIRQ(PININT0_IRQn);	
  
  
  /* Configure pin interrupt selection for the GPIO pin in Input Mux Block */
  Chip_INMUX_PININT_Config(LPC_INMUX, GPIO_EASYLINK_INDEX, GPIO_EASYLINK_PORT, GPIO_EASYLINK_PIN);

  /* Configure channel interrupt as edge sensitive and falling edge interrupt */
  Chip_PININT_ClearIntStatus(LPC_PININT, PININTCH(GPIO_EASYLINK_INDEX));
  Chip_PININT_SetPinModeEdge(LPC_PININT, PININTCH(GPIO_EASYLINK_INDEX));
//  Chip_PININT_EnableIntLow(LPC_PININT, PININTCH(GPIO_EASYLINK_INDEX));
  Chip_PININT_EnableIntHigh(LPC_PININT, PININTCH(GPIO_EASYLINK_INDEX));

  /* Enable interrupt in the NVIC */
  NVIC_ClearPendingIRQ(PININT7_IRQn);
  NVIC_EnableIRQ(PININT7_IRQn);
  
  Chip_INMUX_PININT_Config(LPC_INMUX, GPIO_STANBY_INDEX, GPIO_STANBY_PORT, GPIO_STANBY_PIN);

  Chip_PININT_ClearIntStatus(LPC_PININT, PININTCH(GPIO_STANBY_INDEX));
  Chip_PININT_SetPinModeEdge(LPC_PININT, PININTCH(GPIO_STANBY_INDEX));
  Chip_PININT_EnableIntHigh(LPC_PININT, PININTCH(GPIO_STANBY_INDEX));

  NVIC_ClearPendingIRQ(PININT6_IRQn);
  NVIC_EnableIRQ(PININT6_IRQn);  
  
  return true;
}

uint8_t SPI_Int_DeInit(void)
{
  NVIC_DisableIRQ(PININT0_IRQn);	
  NVIC_ClearPendingIRQ(PININT0_IRQn);
  
  Chip_SPI_DeInit(LPC_SPI1);  

  return true;
}

void SPI_Endian_Set(uint32_t ENDIAN)
{

}

void SPI_DATA_START(void)
{
  /* Setup master trasnfer options - 16 data bits per transfer, EOT, EOF */
  spiMasterXfer.options =
          SPI_TXCTL_FLEN(8) |		/* This must be enabled as a minimum, use 16 data bits */
          // SPI_TXCTL_EOT |			/* Enable this to assert and deassert SSEL for each individual byte/word, current slave functions for this example do not support this */
          // SPI_TXCTL_EOF |			/* Insert a delay between bytes/words as defined by frame delay time */
          // SPI_TXCTL_RXIGNORE |		/* Enable this to ignore incoming data, or set spiMasterXfer.pRXData16 to NULL to ignore RX data  */
          0;

  /* Transfer will terminate after current buffer is sent. If terminate is not set, the buffers
    must be setup by the callbacks		*/
  spiMasterXfer.terminate = true;

  /* Use SPI select 0 */
  spiMasterXfer.sselNum = 0;
  mEnd = false;
}

void SPI_DATA_STOP(void)
{
#ifndef ATH_SPI_DMA
  /* Sleep until transfers are complete */
  while (mEnd == false) {
    //__WFI();
    asm("wfi");
  }
#else
  /*Force an end to the current transfer */
  Chip_SPI_ClearStatus(LPC_SPI1, SPI_STAT_EOT);  
#endif
}

extern volatile uint32_t timer0_cnt;
uint32_t SPI_DATA_READ(uint8_t * pBuffer, uint32_t length)
{
  uint32_t transfer_size;
  OSStatus result;
  spi_cs_Set(0);
  
