SmartArduino/WiFiMCU/Platform/vendor/nxp/LPC54xx/lpc1800_freertos.c
#ifndef WIFI_SPI_PORTNUM1
  
#ifndef ATH_SPI_DMA
  spiMasterXfer.pTXData8 = NULL;
  spiMasterXfer.txCount = length;/* Count is in transfer size */	
  spiMasterXfer.pRXData8 = pBuffer;
  spiMasterXfer.rxCount = length;/* Count is in transfer size */	
	
  Chip_SPIM_Xfer(LPC_SPI0, &spiMasterXfer);	
	
  while (spiMasterXfer.dataRXferred != length) {
    //__WFI();
    asm("wfi");
  }
  
  if(length == 1) {
    if(spiMasterXfer.dataRXferred == length) {
      mEnd = true;
    }
  }
  
  transfer_size = spiMasterXfer.dataRXferred;
#else
  bDMASPITXDoneFlag = false;
  bDMASPIRXDoneFlag = false;
  memset(pBuffer, 0xFF, length);
	Chip_SPI_ClearStatus(LPC_SPI0, SPI_STAT_RXOV | SPI_STAT_TXUR | SPI_STAT_SSA | SPI_STAT_SSD);

  timer0_cnt=0;
  LPC_CTIMER0->TC = 0;
   if(length<=1000) {
    Chip_SPI_ClearStatus(LPC_SPI0, SPI_STAT_RXOV | SPI_STAT_TXUR | SPI_STAT_SSA | SPI_STAT_SSD);

    Chip_DMA_InitChannel( DMAREQ_SPI0_RX, DMA_ADDR(&LPC_SPI0->RXDAT), DMA_XFERCFG_SRCINC_0, 
                          DMA_ADDR(&pBuffer[0]), DMA_XFERCFG_DSTINC_1, WIDTH_8_BITS,
                          length, (DMA_CFG_PERIPHREQEN | DMA_CFG_BURSTPOWER_1 | DMA_CFG_CHPRIORITY(1)));
    Chip_DMA_StartTransfer(DMAREQ_SPI0_RX, DMA_XFERCFG_SRCINC_0, DMA_XFERCFG_DSTINC_1, DMA_XFERCFG_WIDTH_8, length);

    Chip_DMA_InitChannel( DMAREQ_SPI0_TX, DMA_ADDR(&pBuffer[0]), DMA_XFERCFG_SRCINC_1,
                          DMA_ADDR(&LPC_SPI0->TXDAT), DMA_XFERCFG_DSTINC_0, WIDTH_8_BITS,
                          length, (DMA_CFG_PERIPHREQEN | DMA_CFG_BURSTPOWER_1 | DMA_CFG_CHPRIORITY(2)));
    Chip_DMA_StartTransfer(DMAREQ_SPI0_TX, DMA_XFERCFG_SRCINC_1, DMA_XFERCFG_DSTINC_0, DMA_XFERCFG_WIDTH_8, length);
  }
  else {
    bDMASPITXDoneFlag = false;
    bDMASPIRXDoneFlag = false;
    Chip_SPI_ClearStatus(LPC_SPI0, SPI_STAT_RXOV | SPI_STAT_TXUR | SPI_STAT_SSA | SPI_STAT_SSD);

    Chip_DMA_InitChannel( DMAREQ_SPI0_RX, DMA_ADDR(&LPC_SPI0->RXDAT), DMA_XFERCFG_SRCINC_0, 
                          DMA_ADDR(&pBuffer[0]), DMA_XFERCFG_DSTINC_1, WIDTH_8_BITS,
                          1000, (DMA_CFG_PERIPHREQEN | DMA_CFG_BURSTPOWER_1 | DMA_CFG_CHPRIORITY(1)));
    Chip_DMA_StartTransfer(DMAREQ_SPI0_RX, DMA_XFERCFG_SRCINC_0, DMA_XFERCFG_DSTINC_1, DMA_XFERCFG_WIDTH_8, 1000);

    Chip_DMA_InitChannel( DMAREQ_SPI0_TX, DMA_ADDR(&pBuffer[0]), DMA_XFERCFG_SRCINC_1,
                          DMA_ADDR(&LPC_SPI0->TXDAT), DMA_XFERCFG_DSTINC_0, WIDTH_8_BITS,
                          1000, (DMA_CFG_PERIPHREQEN | DMA_CFG_BURSTPOWER_1 | DMA_CFG_CHPRIORITY(2)));
    Chip_DMA_StartTransfer(DMAREQ_SPI0_TX, DMA_XFERCFG_SRCINC_1, DMA_XFERCFG_DSTINC_0, DMA_XFERCFG_WIDTH_8, 1000);
#ifdef SEMAPHORE
  
  result = mico_rtos_get_semaphore( &spi_transfer_finished_semaphore, SEMDELAY );
  while(bDMASPITXDoneFlag == false) {
    //__WFI();
    asm("wfi");
  } 
  while(bDMASPIRXDoneFlag == false) {
    //__WFI();s
    asm("wfi");
  }  
#else
  while(bDMASPITXDoneFlag == false) {
    //__WFI();
    asm("wfi");
  } 
  while(bDMASPIRXDoneFlag == false) {
    //__WFI();s
    asm("wfi");
  }
#endif
    bDMASPITXDoneFlag = false;
    bDMASPIRXDoneFlag = false;
    Chip_SPI_ClearStatus(LPC_SPI0, SPI_STAT_RXOV | SPI_STAT_TXUR | SPI_STAT_SSA | SPI_STAT_SSD);

    Chip_DMA_InitChannel( DMAREQ_SPI0_RX, DMA_ADDR(&LPC_SPI0->RXDAT), DMA_XFERCFG_SRCINC_0, 
                          DMA_ADDR(&pBuffer[1000]), DMA_XFERCFG_DSTINC_1, WIDTH_8_BITS,
                          length - 1000, (DMA_CFG_PERIPHREQEN | DMA_CFG_BURSTPOWER_1 | DMA_CFG_CHPRIORITY(1)));
    Chip_DMA_StartTransfer(DMAREQ_SPI0_RX, DMA_XFERCFG_SRCINC_0, DMA_XFERCFG_DSTINC_1, DMA_XFERCFG_WIDTH_8, length - 1000);

    Chip_DMA_InitChannel( DMAREQ_SPI0_TX, DMA_ADDR(&pBuffer[1000]), DMA_XFERCFG_SRCINC_1,
                          DMA_ADDR(&LPC_SPI0->TXDAT), DMA_XFERCFG_DSTINC_0, WIDTH_8_BITS,
                          length - 1000, (DMA_CFG_PERIPHREQEN | DMA_CFG_BURSTPOWER_1 | DMA_CFG_CHPRIORITY(2)));
    Chip_DMA_StartTransfer(DMAREQ_SPI0_TX, DMA_XFERCFG_SRCINC_1, DMA_XFERCFG_DSTINC_0, DMA_XFERCFG_WIDTH_8, length - 1000);    
  }  
  
#ifdef SEMAPHORE
  result = mico_rtos_get_semaphore( &spi_transfer_finished_semaphore, SEMDELAY );
  while (bDMASPITXDoneFlag == false) { // &&(bDMASPIRXDoneFlag == false)) {
   //__WFI();
    asm("wfi");
  }
  while (bDMASPIRXDoneFlag == false) { // &&(bDMASPIRXDoneFlag == false)) {
    //__WFI();
    asm("wfi");
  }  
#else 
  while (bDMASPITXDoneFlag == false) { // &&(bDMASPIRXDoneFlag == false)) {
   //__WFI();
    asm("wfi");
  }
  while (bDMASPIRXDoneFlag == false) { // &&(bDMASPIRXDoneFlag == false)) {
    //__WFI();
    asm("wfi");
  }  
#endif 
  
#ifdef SPIDEBUG
  if(length >= 1000) //1023)
  printf("timer0_cnt = %d, size %d\r\n", LPC_CTIMER0->TC, length);
#endif
//  Chip_SPI_ClearStatus(LPC_SPI0, SPI_STAT_EOT);
  transfer_size = length;
#endif
  
#else
  

#ifndef ATH_SPI_DMA
  spiMasterXfer.pTXData8 = NULL;
  spiMasterXfer.txCount = length;/* Count is in transfer size */	
  spiMasterXfer.pRXData8 = pBuffer;
  spiMasterXfer.rxCount = length;/* Count is in transfer size */	
	
  Chip_SPIM_Xfer(LPC_SPI1, &spiMasterXfer);	
	
  while (spiMasterXfer.dataRXferred != length) {
    //__WFI();
    asm("wfi");
  }
  
  if(length == 1) {
    if(spiMasterXfer.dataRXferred == length) {
      mEnd = true;
    }
  }
  
  transfer_size = spiMasterXfer.dataRXferred;
#else
  bDMASPITXDoneFlag = false;
  bDMASPIRXDoneFlag = false;
  memset(pBuffer, 0xFF, length);
	Chip_SPI_ClearStatus(LPC_SPI1, SPI_STAT_RXOV | SPI_STAT_TXUR | SPI_STAT_SSA | SPI_STAT_SSD);

  timer0_cnt=0;
  LPC_CTIMER0->TC = 0;
   if(length<=1000) {
    Chip_SPI_ClearStatus(LPC_SPI1, SPI_STAT_RXOV | SPI_STAT_TXUR | SPI_STAT_SSA | SPI_STAT_SSD);

    Chip_DMA_InitChannel( DMAREQ_SPI1_RX, DMA_ADDR(&LPC_SPI1->RXDAT), DMA_XFERCFG_SRCINC_0, 
                          DMA_ADDR(&pBuffer[0]), DMA_XFERCFG_DSTINC_1, WIDTH_8_BITS,
                          length, (DMA_CFG_PERIPHREQEN | DMA_CFG_BURSTPOWER_1 | DMA_CFG_CHPRIORITY(1)));
    Chip_DMA_StartTransfer(DMAREQ_SPI1_RX, DMA_XFERCFG_SRCINC_0, DMA_XFERCFG_DSTINC_1, DMA_XFERCFG_WIDTH_8, length);

    Chip_DMA_InitChannel( DMAREQ_SPI1_TX, DMA_ADDR(&pBuffer[0]), DMA_XFERCFG_SRCINC_1,
                          DMA_ADDR(&LPC_SPI1->TXDAT), DMA_XFERCFG_DSTINC_0, WIDTH_8_BITS,
                          length, (DMA_CFG_PERIPHREQEN | DMA_CFG_BURSTPOWER_1 | DMA_CFG_CHPRIORITY(2)));
    Chip_DMA_StartTransfer(DMAREQ_SPI1_TX, DMA_XFERCFG_SRCINC_1, DMA_XFERCFG_DSTINC_0, DMA_XFERCFG_WIDTH_8, length);
  }
  else {
    bDMASPITXDoneFlag = false;
    bDMASPIRXDoneFlag = false;
    Chip_SPI_ClearStatus(LPC_SPI1, SPI_STAT_RXOV | SPI_STAT_TXUR | SPI_STAT_SSA | SPI_STAT_SSD);

    Chip_DMA_InitChannel( DMAREQ_SPI1_RX, DMA_ADDR(&LPC_SPI1->RXDAT), DMA_XFERCFG_SRCINC_0, 
                          DMA_ADDR(&pBuffer[0]), DMA_XFERCFG_DSTINC_1, WIDTH_8_BITS,
                          1000, (DMA_CFG_PERIPHREQEN | DMA_CFG_BURSTPOWER_1 | DMA_CFG_CHPRIORITY(1)));
    Chip_DMA_StartTransfer(DMAREQ_SPI1_RX, DMA_XFERCFG_SRCINC_0, DMA_XFERCFG_DSTINC_1, DMA_XFERCFG_WIDTH_8, 1000);

    Chip_DMA_InitChannel( DMAREQ_SPI1_TX, DMA_ADDR(&pBuffer[0]), DMA_XFERCFG_SRCINC_1,
                          DMA_ADDR(&LPC_SPI1->TXDAT), DMA_XFERCFG_DSTINC_0, WIDTH_8_BITS,
                          1000, (DMA_CFG_PERIPHREQEN | DMA_CFG_BURSTPOWER_1 | DMA_CFG_CHPRIORITY(2)));
    Chip_DMA_StartTransfer(DMAREQ_SPI1_TX, DMA_XFERCFG_SRCINC_1, DMA_XFERCFG_DSTINC_0, DMA_XFERCFG_WIDTH_8, 1000);
#ifdef SEMAPHORE
    result = mico_rtos_get_semaphore( &spi_transfer_finished_semaphore, SEMDELAY );
    while(bDMASPITXDoneFlag == false) {
      asm("wfi");
    } 
    while(bDMASPIRXDoneFlag == false) {
      asm("wfi");
    }
#else
    while(bDMASPITXDoneFlag == false) {
      asm("wfi");
    } 
    while(bDMASPIRXDoneFlag == false) {
      asm("wfi");
    }
#endif
    bDMASPITXDoneFlag = false;
    bDMASPIRXDoneFlag = false;
    Chip_SPI_ClearStatus(LPC_SPI1, SPI_STAT_RXOV | SPI_STAT_TXUR | SPI_STAT_SSA | SPI_STAT_SSD);

    Chip_DMA_InitChannel( DMAREQ_SPI1_RX, DMA_ADDR(&LPC_SPI1->RXDAT), DMA_XFERCFG_SRCINC_0, 
                          DMA_ADDR(&pBuffer[1000]), DMA_XFERCFG_DSTINC_1, WIDTH_8_BITS,
                          length - 1000, (DMA_CFG_PERIPHREQEN | DMA_CFG_BURSTPOWER_1 | DMA_CFG_CHPRIORITY(1)));
    Chip_DMA_StartTransfer(DMAREQ_SPI0_RX, DMA_XFERCFG_SRCINC_0, DMA_XFERCFG_DSTINC_1, DMA_XFERCFG_WIDTH_8, length - 1000);

    Chip_DMA_InitChannel( DMAREQ_SPI1_TX, DMA_ADDR(&pBuffer[1000]), DMA_XFERCFG_SRCINC_1,
                          DMA_ADDR(&LPC_SPI1->TXDAT), DMA_XFERCFG_DSTINC_0, WIDTH_8_BITS,
                          length - 1000, (DMA_CFG_PERIPHREQEN | DMA_CFG_BURSTPOWER_1 | DMA_CFG_CHPRIORITY(2)));
    Chip_DMA_StartTransfer(DMAREQ_SPI1_TX, DMA_XFERCFG_SRCINC_1, DMA_XFERCFG_DSTINC_0, DMA_XFERCFG_WIDTH_8, length - 1000);    
  }  
  
#ifdef SEMAPHORE
  result = mico_rtos_get_semaphore( &spi_transfer_finished_semaphore, SEMDELAY );  
  while (bDMASPITXDoneFlag == false) { // &&(bDMASPIRXDoneFlag == false)) {
   //__WFI();
    asm("wfi");
  }
  while (bDMASPIRXDoneFlag == false) { // &&(bDMASPIRXDoneFlag == false)) {
    //__WFI();
    asm("wfi");
  }  
#else 
  while (bDMASPITXDoneFlag == false) { // &&(bDMASPIRXDoneFlag == false)) {
   //__WFI();
    asm("wfi");
  }
  while (bDMASPIRXDoneFlag == false) { // &&(bDMASPIRXDoneFlag == false)) {
    //__WFI();
    asm("wfi");
  }  
#endif 
  
#ifdef SPIDEBUG
  if(length >= 1000) //1023)
  printf("timer0_cnt = %d, size %d\r\n", LPC_CTIMER0->TC, length);
#endif
//  Chip_SPI_ClearStatus(LPC_SPI0, SPI_STAT_EOT);
  transfer_size = length;
#endif
  
#endif
  spi_cs_Set(1);
  return transfer_size;
}

uint32_t SPI_DATA_WRITE(uint8_t * pBuffer, uint32_t length)
{
  uint32_t transfer_size;
  OSStatus result;
  uint32_t junk;
  
//  printf("SPI_DATA_WRITE 0x%x\r\n", length);
  spi_cs_Set(0);
  
