SmartArduino/WiFiMCU/Platform/vendor/nxp/LPC54xx/lpc1800_freertos.c
    bDMASPITXDoneFlag = false;
    bDMASPIRXDoneFlag = false;
    
    Chip_DMA_InitChannel( DMAREQ_SPI1_RX, DMA_ADDR(&LPC_SPI1->RXDAT), DMA_XFERCFG_SRCINC_0, 
                          DMA_ADDR(&pBufferR[1000]), DMA_XFERCFG_DSTINC_1, WIDTH_8_BITS,
                          lengthR-1000, (DMA_CFG_PERIPHREQEN | DMA_CFG_BURSTPOWER_1 | DMA_CFG_CHPRIORITY(1)));
    Chip_DMA_StartTransfer(DMAREQ_SPI1_RX, DMA_XFERCFG_SRCINC_0, DMA_XFERCFG_DSTINC_1, DMA_XFERCFG_WIDTH_8, lengthR - 1000);

    Chip_DMA_InitChannel( DMAREQ_SPI1_TX, DMA_ADDR(&pBufferW[1000]), DMA_XFERCFG_SRCINC_1,
                          DMA_ADDR(&LPC_SPI1->TXDAT), DMA_XFERCFG_DSTINC_0, WIDTH_8_BITS,
                          lengthW-1000, (DMA_CFG_PERIPHREQEN | DMA_CFG_BURSTPOWER_1 | DMA_CFG_CHPRIORITY(2)));
    Chip_DMA_StartTransfer(DMAREQ_SPI1_TX, DMA_XFERCFG_SRCINC_1, DMA_XFERCFG_DSTINC_0, DMA_XFERCFG_WIDTH_8, lengthW - 1000);    
  }  
  
#ifdef SEMAPHORE
  
  result = mico_rtos_get_semaphore( &spi_transfer_finished_semaphore, SEMDELAY );
  while (bDMASPITXDoneFlag == false) { // &&(bDMASPIRXDoneFlag == false)) {
   //__WFI();
    asm("wfi");
  }
  while (bDMASPIRXDoneFlag == false) { // &&(bDMASPIRXDoneFlag == false)) {
    //__WFI();
    asm("wfi");
  }   
#else
   while (bDMASPITXDoneFlag == false) { // &&(bDMASPIRXDoneFlag == false)) {
   //__WFI();
    asm("wfi");
  }
 while (bDMASPIRXDoneFlag == false) { // &&(bDMASPIRXDoneFlag == false)) {
    //__WFI();
    asm("wfi");
  }   
#endif
  transfer_size = lengthR;
#endif
  
#ifdef SPIDEBUG
  if(lengthR > 1000) // 1023)
  printf("timer0_cnt = %d, size %d\r\n", LPC_CTIMER0->TC, lengthR);
#endif
  
#endif
  spi_cs_Set(1);
  return transfer_size;
}

void SPI_IRQ_ENABLE(void)
{
  Chip_PININT_Init(LPC_PININT);
  Chip_IOCON_PinMuxSet(LPC_IOCON, GPIO_SPIINT_PORT, GPIO_SPIINT_PIN, (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN  | IOCON_GPIO_MODE));
  Chip_GPIO_SetPinDIRInput(LPC_GPIO, GPIO_SPIINT_PORT, GPIO_SPIINT_PIN);
  /* Configure pin interrupt selection for the GPIO pin in Input Mux Block */
  Chip_INMUX_PININT_Config(LPC_INMUX, GPIO_SPIINT_INDEX, GPIO_SPIINT_PORT, GPIO_SPIINT_PIN);
  /* Configure channel interrupt as edge sensitive and falling edge interrupt */
  Chip_PININT_ClearIntStatus(LPC_PININT, PININTCH(GPIO_SPIINT_INDEX));
  Chip_PININT_SetPinModeEdge(LPC_PININT, PININTCH(GPIO_SPIINT_INDEX));
//  Chip_PININT_EnableIntLow(LPC_PININT, PININTCH(GPIO_SPIINT_INDEX));
  Chip_PININT_EnableIntHigh(LPC_PININT, PININTCH(GPIO_SPIINT_INDEX));
  NVIC_SetPriority(PININT0_IRQn, 2);
  /* Enable interrupt in the NVIC */
  NVIC_ClearPendingIRQ(PININT0_IRQn);
  NVIC_EnableIRQ(PININT0_IRQn);
}

void SPI_IRQ_DISABLE(void)
{
  /* Enable interrupt in the NVIC */
  NVIC_ClearPendingIRQ(PININT0_IRQn);
  NVIC_DisableIRQ(PININT0_IRQn);
}

// ---------------------------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------------------------

#include "spi_flash_platform_interface.h"
//#define SPIFLASHDEBUG 1
// Initial SPI Flash
//#define SPIMASTERIRQHANDLER             SPI1_IRQHandler
#define LPC_SPIMASTERPORT               LPC_SPI1
#define LPC_SPIMASTERIRQNUM             SPI1_IRQn
/* The slave can handle data up to the point of overflow or underflow.
   Adjust this clock rate and the master's timing delays to get a working
   SPI slave rate. */
#define LPCMASTERCLOCKRATE              (4000000)
#define BUFFER_SIZE 300

#define SPI_FLASH_CMD_READ_DEVID        0x90
#define SPI_FLASH_CMD_WRITE_ENABLE      0x06
#define SPI_FLASH_CMD_WRITE_DISABLE     0x04

#define SPI_FLASH_CMD_READ_DATA         0x03
#define SPI_FLASH_CMD_READ_FAST         0x0B

#define SPI_FLASH_CMD_WRITE_DATA        0x02
#define SPI_FLASH_CMD_ERASE             0x20
#define SPI_FLASH_CMD_ERASE_32KB        0x52
#define SPI_FLASH_CMD_ERASE_64KB        0xD8
#define SPI_FLASH_CMD_ERASE_CHIP        0xC7

#define SPI_FLASH_CMD_WRITE_STATUS      0x01
#define SPI_FLASH_CMD_READ_STATUS1      0x05
#define SPI_FLASH_CMD_READ_STATUS2      0x35

#define SPI_FLASH_PAGESIZE              256  

volatile uint8_t Flash_mEnd;
/* Master transmit and receive buffers */
uint8_t masterRXBuffer8[BUFFER_SIZE], masterTXBuffer8[BUFFER_SIZE];


static void flash_spi_pinmux_init(void)
{
  /* Connect the SPI1 signals to port pins */
  Chip_IOCON_PinMuxSet(LPC_IOCON, 0, 6 ,  (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));	/* SPI1_SCK */
  Chip_IOCON_PinMuxSet(LPC_IOCON, 1, 16,  (IOCON_FUNC0 | IOCON_MODE_INACT | IOCON_DIGITAL_EN));	/* SPI1_MISO */
  Chip_IOCON_PinMuxSet(LPC_IOCON, 0, 7 ,  (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));	/* SPI1_MOSI */
  Chip_IOCON_PinMuxSet(LPC_IOCON, 0, 8 ,  (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));	/* SPI1_SSEL0 */
 
//  Chip_IOCON_PinMuxSet(LPC_IOCON, 1, 15,  (IOCON_FUNC0 | IOCON_MODE_PULLUP | IOCON_DIGITAL_EN));
//  Chip_GPIO_SetPinDIROutput(LPC_GPIO, 1, 15);
//  Chip_GPIO_SetPinState(LPC_GPIO, 1, 15, 1);
  
  Chip_GPIO_SetPinDIROutput(LPC_GPIO, 0, 6);
  Chip_GPIO_SetPinState(LPC_GPIO, 0, 6, 0);     /* SPI1_SCK */
  
  Chip_GPIO_SetPinDIRInput(LPC_GPIO, 1, 16);    /* SPI1_MISO */
  Chip_GPIO_SetPinState(LPC_GPIO, 1, 16, 0);
  
  Chip_GPIO_SetPinDIROutput(LPC_GPIO, 0, 7);    /* SPI1_MOSI */
  Chip_GPIO_SetPinState(LPC_GPIO, 0, 7, 1);
  
  Chip_GPIO_SetPinDIROutput(LPC_GPIO, 0, 8);/* SPI1_SSEL0 */
  Chip_GPIO_SetPinState(LPC_GPIO, 0, 8, 1);
}

#define SPI_FLASH_CS_LOW         Chip_GPIO_SetPinState(LPC_GPIO, 0, 8, 0)
#define SPI_FLASH_CS_HIGH        Chip_GPIO_SetPinState(LPC_GPIO, 0, 8, 1)

#define SPI_FLASH_MISO_LOW
#define SPI_FLASH_MISO_HIGH

#define SPI_FLASH_MISO_GET      Chip_GPIO_GetPinState(LPC_GPIO, 1, 16)

#define SPI_FLASH_MOSI_LOW       Chip_GPIO_SetPinState(LPC_GPIO, 0, 7, 0)
#define SPI_FLASH_MOSI_HIGH      Chip_GPIO_SetPinState(LPC_GPIO, 0, 7, 1)

#define SPI_FLASH_SCK_LOW       Chip_GPIO_SetPinState(LPC_GPIO, 0, 6, 0)
#define SPI_FLASH_SCK_HIGH      Chip_GPIO_SetPinState(LPC_GPIO, 0, 6, 1)

