SmartArduino/WiFiMCU/Platform/vendor/nxp/LPC54xx/lpc1800_freertos.c
uint8_t spi_wr(uint8_t data)
{
  uint32_t i = 0;
  uint8_t ret = 0;
  
  for(i=0; i<8; i++) {
    ret = ((ret<<1)&0xFE);
    SPI_FLASH_SCK_LOW;
    if(data&0x80) {
      SPI_FLASH_MOSI_HIGH;
    }
    else{
      SPI_FLASH_MOSI_LOW;
    }
    SPI_FLASH_SCK_HIGH;
    data = (data<<1);
    if((SPI_FLASH_MISO_GET&0x01) == 1) {
      ret = ret|0x01;
    }
    else {
      ret &= 0xFE;
    }
  }

  return ret;
}

void flash_spi_master_set(void)
{
  SPI_FLASH_CS_HIGH;
  SPI_FLASH_SCK_HIGH;
}

static uint8_t spi_flash_init(void)
{
  uint8_t ret = 0;
  
   /* SPI initialization */
  flash_spi_pinmux_init();
  /* Enable SysTick Timer */
  /* Setup SPI controllers */
  flash_spi_master_set();
  SPI_FLASH_CS_LOW;
  SPI_FLASH_CS_HIGH;
  SPI_FLASH_SCK_LOW;
  SPI_FLASH_SCK_HIGH;
  SPI_FLASH_MOSI_LOW;
  SPI_FLASH_MOSI_HIGH;
  
  ret = 1;
  return ret;
}


int sflash_platform_init( int peripheral_id, void** platform_peripheral_out )
{
  uint8_t temp1, temp2;
  uint32_t j;
  spi_flash_init();
  
  SPI_FLASH_CS_LOW;
  temp1 = spi_wr(0x90);
  temp1 = spi_wr(0x00);
  temp1 = spi_wr(0x00);
  temp1 = spi_wr(0x00);
  temp1 = spi_wr(0x00);
  temp2 = spi_wr(0x00);
  SPI_FLASH_CS_HIGH;
  for(j=0; j<5000; j++);
  printf("Flash ID1 %x, %x, %x\r\n", temp1, temp2, j);
 
  SPI_FLASH_CS_LOW;
  temp1 = spi_wr(0x90);
  temp1 = spi_wr(0x00);
  temp1 = spi_wr(0x00);
  temp1 = spi_wr(0x00);
  temp1 = spi_wr(0x00);
  temp2 = spi_wr(0x00);
  SPI_FLASH_CS_HIGH;
  for(j=0; j<5000; j++);
  printf("Flash ID2 %x, %x. %x\r\n", temp1, temp2, j);
  return 0;
}

volatile uint8_t spi_flash_recv;
int sflash_platform_send_recv_byte( void* platform_peripheral, unsigned char MOSI_val, void* MISO_addr )
{
//  int ret;
  uint8_t *rcv_buf;
  if(MISO_addr != 0x00000000)
  rcv_buf = MISO_addr;
  else
  rcv_buf = (uint8_t *)&spi_flash_recv;
  *rcv_buf = spi_wr(MOSI_val);
#ifdef SPIFLASHDEBUG
  printf("SPI RW %x %d, %x\r\n", MOSI_val, 1, *rcv_buf);
#endif
  return 0;
}

int sflash_platform_chip_select( void* platform_peripheral )
{
  Chip_GPIO_SetPinState(LPC_GPIO, 0, 8 , 0);
  return 0;
}

int sflash_platform_chip_deselect( void* platform_peripheral )
{
  Chip_GPIO_SetPinState(LPC_GPIO, 0, 8 , 1);
  return 0;
}


// end file
